Updating algo design process flow
